In [1]:
import pandas as pd

In [2]:
#Import Data #1
application = "application_record.csv"
df_application = pd.read_csv(application)
df_application.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0

In [3]:
df_application.shape

(438557, 18)

In [4]:
#Names of columns
df_application.columns

Index(['ID', 'CODE_GENDER', 'FLAG_OWN_CAR', 'FLAG_OWN_REALTY', 'CNT_CHILDREN',
       'AMT_INCOME_TOTAL', 'NAME_INCOME_TYPE', 'NAME_EDUCATION_TYPE',
       'NAME_FAMILY_STATUS', 'NAME_HOUSING_TYPE', 'DAYS_BIRTH',
       'DAYS_EMPLOYED', 'FLAG_MOBIL', 'FLAG_WORK_PHONE', 'FLAG_PHONE',
       'FLAG_EMAIL', 'OCCUPATION_TYPE', 'CNT_FAM_MEMBERS'],
      dtype='object')

In [6]:
#Re-name columns
df_application = df_application.rename(columns={"CODE_GENDER": "Gender", "FLAG_OWN_CAR": "Own_Car", "FLAG_OWN_REALTY": "Own_Property", "CNT_CHILDREN": "Num_of_Children", "AMT_INCOME_TOTAL": "Income", "NAME_INCOME_TYPE": "Income_Type", "NAME_EDUCATION_TYPE": "Education_Level", "NAME_FAMILY_STATUS": "Marital_Status", "NAME_HOUSING_TYPE": "Housing_Type", "DAYS_BIRTH": "Date_of_Birth", "DAYS_EMPLOYED": "Days_Employed", "FLAG_MOBIL": "Cell_Number", "FLAG_WORK_PHONE": "Work_Number", "FLAG_PHONE": "Phone_Number", "FLAG_EMAIL": "Email", "OCCUPATION_TYPE": "Occupation_Type", "CNT_FAM_MEMBERS": "Family_Size"})
df_application.columns

Index(['ID', 'Gender', 'Own_Car', 'Own_Property', 'Num_of_Children', 'Income',
       'Income_Type', 'Education_Level', 'Marital_Status', 'Housing_Type',
       'Date_of_Birth', 'Days_Employed', 'Cell_Number', 'Work_Number',
       'Phone_Number', 'Email', 'Occupation_Type', 'Family_Size'],
      dtype='object')

In [7]:
#Drop unneded columns
df_app = df_application.drop(columns=["Cell_Number", "Work_Number", "Phone_Number", "Email"])

In [8]:
#Import Data #2
credit = "credit_record.csv"
df_credit = pd.read_csv(credit)
df_credit.head()

        ID  MONTHS_BALANCE STATUS
0  5001711               0      X
1  5001711              -1      0
2  5001711              -2      0
3  5001711              -3      0
4  5001712               0      C

In [9]:
df_credit.shape

(1048575, 3)

In [10]:
#Names of columns
df_credit.columns

Index(['ID', 'MONTHS_BALANCE', 'STATUS'], dtype='object')

In [11]:
#Rename columns
df_credit = df_credit.rename(columns={"MONTHS_BALANCE": "Monthly_Balance", "STATUS": "Loan_Status"})
df_credit.columns

Index(['ID', 'Monthly_Balance', 'Loan_Status'], dtype='object')

In [12]:
#Information about Appliction DataFrame
df_app.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 14 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   ID               438557 non-null  int64
 1   Gender           438557 non-null  object
 2   Own_Car          438557 non-null  object
 3   Own_Property     438557 non-null  object
 4   Num_of_Children  438557 non-null  int64
 5   Income           438557 non-null  float64
 6   Income_Type      438557 non-null  object
 7   Education_Level  438557 non-null  object
 8   Marital_Status   438557 non-null  object
 9   Housing_Type     438557 non-null  object
 10  Date_of_Birth    438557 non-null  int64
 11  Days_Employed    438557 non-null  int64
 12  Occupation_Type  304354 non-null  object
 13  Family_Size      438557 non-null  float64
dtypes: float64(2), int64(4), object(8)
memory usage: 46.8+ MB

In [13]:
#Find data type of each columns in Application DataFrame
df_app.dtypes

ID                   int64
Gender              object
Own_Car             object
Own_Property        object
Num_of_Children      int64
Income             float64
Income_Type         object
Education_Level     object
Marital_Status      object
Housing_Type        object
Date_of_Birth        int64
Days_Employed        int64
Occupation_Type     object
Family_Size        float64
dtype: object

In [14]:
#Return all unique values in column
df_app["Gender"].value_counts()

F    294440
M    144117
Name: Gender, dtype: int64

In [15]:
#Change data type of column
df_app["Gender"] = df_app["Gender"].astype("category")

In [16]:
#Return all unique values in column
df_app["Own_Car"].value_counts()

N    275459
Y    163098
Name: Own_Car, dtype: int64

In [17]:
#Change data type of column
df_app["Own_Car"] = df_app["Own_Car"].astype("bool")

In [18]:
#Return all unique values in column
df_app["Own_Property"].value_counts()

Y    304074
N    134483
Name: Own_Property, dtype: int64

In [19]:
#Change data type of column
df_app["Own_Property"] = df_app["Own_Property"].astype("bool")

In [20]:
#Return all unique values in column
df_app["Income_Type"].value_counts()

Working                 226104
Commercial associate    100757
Pensioner                75493
State servant            36186
Student                     17
Name: Income_Type, dtype: int64

In [21]:
#Change data type of column
df_app["Income_Type"] = df_app["Income_Type"].astype("category")

In [22]:
#Return all unique values in column
df_app["Education_Level"].value_counts()

Secondary / secondary special    301821
Higher education                 117522
Incomplete higher                 14851
Lower secondary                    4051
Academic degree                     312
Name: Education_Level, dtype: int64

In [23]:
#Change data type of column
df_app["Education_Level"] = df_app["Education_Level"].astype("category")

In [24]:
#Return all unique values in column
df_app["Marital_Status"].value_counts()

Married                 299828
Single / not married     55271
Civil marriage           36532
Separated                27251
Widow                    19675
Name: Marital_Status, dtype: int64

In [25]:
#Change data type of column
df_app["Marital_Status"] = df_app["Marital_Status"].astype("category")

In [26]:
#Return all unique values in column
df_app["Housing_Type"].value_counts()

House / apartment      393831
With parents            19077
Municipal apartment     14214
Rented apartment         5974
Office apartment         3922
Co-op apartment          1539
Name: Housing_Type, dtype: int64

In [27]:
#Change data type of column
df_app["Housing_Type"] = df_app["Housing_Type"].astype("category")

In [28]:
#Return all unique values in column
df_app["Family_Size"].value_counts()

2.0     233891
1.0      84492
3.0      77128
4.0      37356
5.0       5081
6.0        459
7.0        124
9.0          9
11.0         5
14.0         4
8.0          4
15.0         3
20.0         1
Name: Family_Size, dtype: int64

In [29]:
#Change data type of column
df_app["Family_Size"] = df_app["Family_Size"].astype("int")

In [30]:
#Return all unique values in column
df_app["Date_of_Birth"].value_counts()

-11707    150
-14178    121
-14400    116
-13482    112
-13274    112
         ...
-8207       1
-8286       1
-12793      1
-24592      1
-8590       1
Name: Date_of_Birth, Length: 16379, dtype: int64

In [31]:
#Date_of_Birth column counts days since birth backwards from current day
#Goal: Convert Date_of_Birth column to DateTime Format
#Check for any missing value
df_app["Date_of_Birth"].isna().sum()

0

In [32]:
#Values '0' or any positive value means person was born today or in the future
sum(df_app["Date_of_Birth"] >= 0)

0

In [33]:
#Convert all negative values to postive values
df_app["Date_of_Birth"] = df_app["Date_of_Birth"].abs()
sum(df_app["Date_of_Birth"] <= 0)

0

In [34]:
#Convert Days_Birth into DateTime Format
from datetime import datetime, timedelta, date
today_date = datetime.now()
df_app["Date_of_Birth"] = today_date - pd.to_timedelta(df_app["Date_of_Birth"], unit= "d")
df_app["Date_of_Birth"] = df_app["Date_of_Birth"].astype("datetime64")
df_app["Date_of_Birth"]

0        1990-09-22 16:28:04.688849
1        1990-09-22 16:28:04.688849
2        1964-10-19 16:28:04.688849
3        1971-04-10 16:28:04.688849
4        1971-04-10 16:28:04.688849
                    ...
438552   1961-05-25 16:28:04.688849
438553   1979-12-15 16:28:04.688849
438554   2001-03-24 16:28:04.688849
438555   1964-04-03 16:28:04.688849
438556   1971-12-18 16:28:04.688849
Name: Date_of_Birth, Length: 438557, dtype: datetime64[ns]

In [35]:
#Change format of Date_of_Birth to DD-MM-YYYY
df_app["Date_of_Birth"] = df_app["Date_of_Birth"].dt.normalize()
df_app["Date_of_Birth"] = df_app["Date_of_Birth"].dt.strftime('%m-%d-%Y')
df_app["Date_of_Birth"]

0         09-22-1990
1         09-22-1990
2         10-19-1964
3         04-10-1971
4         04-10-1971
             ...
438552    05-25-1961
438553    12-15-1979
438554    03-24-2001
438555    04-03-1964
438556    12-18-1971
Name: Date_of_Birth, Length: 438557, dtype: object

In [36]:
#Calculate Age from Data_of_Birth
import datetime
list_dob = list(df_app["Date_of_Birth"].astype("str"))
dob = {"DOB": list_dob} 
df = pd.DataFrame(data = dob)

def age(birth_date):
    birth_date = datetime.datetime.strptime(birth_date, "%m-%d-%Y").date()
    today = date.today()
    return today.year - birth_date.year - ((today.month, today.day) < (birth_date.month, birth_date.day))
df["Age"] = df["DOB"].apply(age)
display(df)

               DOB  Age
0       09-22-1990   32
1       09-22-1990   32
2       10-19-1964   58
3       04-10-1971   52
4       04-10-1971   52
...            ...  ...
438552  05-25-1961   62
438553  12-15-1979   43
438554  03-24-2001   22
438555  04-03-1964   59
438556  12-18-1971   51

[438557 rows x 2 columns]

In [37]:
#Add Age as a column of DataFrame
df_app["Age"] = df["Age"]

In [39]:
#Return all unique values in column
df_app["Days_Employed"].value_counts()

 365243    75329
-218         262
-1678        251
-249         241
-978         240
           ...
-13529         1
-10223         1
-8917          1
-11429         1
-8105          1
Name: Days_Employed, Length: 9406, dtype: int64

In [40]:
#Days_Employeed column counts days of employment backwords from current day. Positive values mean unemployed.
#Add a column for Employment status
df_app["Employed"] = df_app["Days_Employed"] < 0
df_app["Employed"] = df_app["Employed"].astype("bool")

In [41]:
#Return all unique values in column
df_app["Income"].value_counts()

135000.0    46879
157500.0    39768
180000.0    37912
112500.0    36979
225000.0    34130
            ...
151425.0        1
133461.0        1
265950.0        1
201150.0        1
36679.5         1
Name: Income, Length: 866, dtype: int64

In [42]:
#Break Income column into categories
#Create Income_Level categories
group_names = ["0-100k", "100K-200K", "200K-300K", "300K-400K", "400K-500K", "500K+"]
df_app["Income_level"] = pd.qcut(df_app["Income"], q=6, labels=group_names)
df_app[["Income_level", "Income"]]

       Income_level    Income
0             500K+  427500.0
1             500K+  427500.0
2            0-100k  112500.0
3         400K-500K  270000.0
4         400K-500K  270000.0
...             ...       ...
438552    100K-200K  135000.0
438553       0-100k  103500.0
438554       0-100k   54000.0
438555       0-100k   72000.0
438556    100K-200K  121500.0

[438557 rows x 2 columns]

In [44]:
#Assign Income values to Income_Level Categories
import numpy as np
ranges = [0,100000,200000,300000,400000,500000,np.inf]
df_app["Income_level"] = pd.cut(df_app["Income"], bins=ranges, labels=group_names)
df_app[["Income_level", "Income"]]

       Income_level    Income
0         400K-500K  427500.0
1         400K-500K  427500.0
2         100K-200K  112500.0
3         200K-300K  270000.0
4         200K-300K  270000.0
...             ...       ...
438552    100K-200K  135000.0
438553    100K-200K  103500.0
438554       0-100k   54000.0
438555       0-100k   72000.0
438556    100K-200K  121500.0

[438557 rows x 2 columns]

In [45]:
#Add Invome_Level as a column of dataframe
df_app["Income_level"] = df_app["Income_level"].astype("category")

In [46]:
df_app.head(5)

,ID,Gender,Own_Car,Own_Property,Num_of_Children,Income,Income_Type,Education_Level,Marital_Status,Housing_Type,Date_of_Birth,Days_Employed,Occupation_Type,Family_Size,Age,Employed,Income_level
0,5008804,M,True,True,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,09-22-1990,-4542,NaN,2,32,True,400K-500K
1,5008805,M,True,True,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,09-22-1990,-4542,NaN,2,32,True,400K-500K
2,5008806,M,True,True,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,10-19-1964,-1134,Security staff,2,58,True,100K-200K
3,5008808,F,True,True,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,04-10-1971,-3051,Sales staff,1,52,True,200K-300K
4,5008809,F,True,True,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,04-10-1971,-3051,Sales staff,1,52,True,200K-300K

In [50]:
df_app.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 17 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   ID               438557 non-null  int64
 1   Gender           438557 non-null  category
 2   Own_Car          438557 non-null  bool
 3   Own_Property     438557 non-null  bool
 4   Num_of_Children  438557 non-null  int64
 5   Income           438557 non-null  float64
 6   Income_Type      438557 non-null  category
 7   Education_Level  438557 non-null  category
 8   Marital_Status   438557 non-null  category
 9   Housing_Type     438557 non-null  category
 10  Date_of_Birth    438557 non-null  object
 11  Days_Employed    438557 non-null  int64
 12  Occupation_Type  304354 non-null  object
 13  Family_Size      438557 non-null  int32
 14  Age              438557 non-null  int64
 15  Employed         438557 non-null  bool
 16  Income_level     438557 non-null  category
dtypes: bool(3), category(6), float64(1), int32(1), int64(4), object(2)
memory usage: 28.9+ MB

In [51]:
#Check for null values
df_app.isnull().sum()

ID                      0
Gender                  0
Own_Car                 0
Own_Property            0
Num_of_Children         0
Income                  0
Income_Type             0
Education_Level         0
Marital_Status          0
Housing_Type            0
Date_of_Birth           0
Days_Employed           0
Occupation_Type    134203
Family_Size             0
Age                     0
Employed                0
Income_level            0
dtype: int64

In [52]:
#Check for duplicate IDs
dup = df_app[df_app["ID"].duplicated(keep=False)]
dup.shape

(94, 17)

In [63]:
dup.sort_values(by="ID")

,ID,Gender,Own_Car,Own_Property,Num_of_Children,Income,Income_Type,Education_Level,Marital_Status,Housing_Type,Date_of_Birth,Days_Employed,Occupation_Type,Family_Size,Age,Employed,Income_level
426818,7022197,M,True,True,3,135000.0,Working,Secondary / secondary special,Married,House / apartment,11-21-1990,-735,Laborers,5,32,True,100K-200K
425023,7022197,F,True,True,0,450000.0,Commercial associate,Higher education,Separated,House / apartment,05-07-1969,-1799,NaN,1,54,True,400K-500K
431545,7022327,F,True,True,0,135000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,02-25-1983,-5298,High skill tech staff,1,40,True,100K-200K
431911,7022327,M,True,True,0,256500.0,Commercial associate,Higher education,Married,House / apartment,09-20-1964,-1674,Core staff,2,58,True,200K-300K
425486,7023108,M,True,True,1,67500.0,Working,Secondary / secondary special,Married,House / apartment,02-05-1982,-1696,Core staff,3,41,True,0-100k
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
426563,7836711,F,True,True,2,292500.0,Working,Higher education,Married,House / apartment,12-15-1985,-4386,Accountants,4,37,True,200K-300K
421464,7836971,M,True,True,1,157500.0,Working,Secondary / secondary special,Married,House / apartment,11-21-1985,-5520,NaN,3,37,True,100K-200K
428620,7836971,F,True,True,0,103500.0,Working,Secondary / secondary special,Civil marriage,House / apartment,12-14-1986,-2798,Sales staff,2,36,True,100K-200K
422068,7838075,M,True,True,0,337500.0,Commercial associate,Secondary / secondary special,Married,House / apartment,10-08-1973,-1275,Drivers,2,49,True,300K-400K
423702,7838075,F,True,True,0,315000.0,Commercial associate,Higher education,Single / not married,House / apartment,04-21-1994,-1659,NaN,1,29,True,300K-400K

In [54]:
#Duplicate rows have duplicate IDs with different gender and date of birth
#drop all rows with duplicate IDs
df_app.drop_duplicates("ID", keep = False, inplace=True)
df_app.shape

(438463, 17)

In [55]:
#Find data type of each columns in Credit DataFrame
df_credit.dtypes

ID                  int64
Monthly_Balance     int64
Loan_Status        object
dtype: object

In [57]:
#Find all duplicate IDs in dataframe
duplicate = df_credit[df_credit["ID"].duplicated(keep=False)]
duplicate

              ID  Monthly_Balance Loan_Status
0        5001711                0           X
1        5001711               -1           0
2        5001711               -2           0
3        5001711               -3           0
4        5001712                0           C
...          ...              ...         ...
1048570  5150487              -25           C
1048571  5150487              -26           C
1048572  5150487              -27           C
1048573  5150487              -28           C
1048574  5150487              -29           C

[1048176 rows x 3 columns]

In [59]:
#Group duplicate IDs by loan_Status
#Check for missing values
df_credit["Loan_Status"].isnull().sum()

0

In [64]:
# Loan_Status values: 0,1,2,3,4,and 5 -> Past Due
#Loan_Status values: C and X -> Paid Off of No Loan
past_due = ["0", "1", "2", "3", "4", "5"]
delinquent = df_credit[df_credit.Loan_Status.isin(past_due)].ID.unique()
df_credit["Good_Customer"] = ~df_credit.ID.isin(delinquent)
df_credit_1 = df_credit[["ID", "Good_Customer"]].drop_duplicates()
df_credit_1.head(5)

         ID  Good_Customer
0   5001711          False
4   5001712          False
23  5001713           True
45  5001714           True
60  5001715           True

In [65]:
#Check for null values in dataframe
df_credit_1.isnull().sum()

ID               0
Good_Customer    0
dtype: int64

In [66]:
df_app.shape

(438463, 17)

In [67]:
df_credit_1.shape

(45985, 2)

In [68]:
#Join dataframes: Left_Join
df = df_app.merge(df_credit_1, on="ID", how="left")
df.head(5)

,ID,Gender,Own_Car,Own_Property,Num_of_Children,Income,Income_Type,Education_Level,Marital_Status,Housing_Type,Date_of_Birth,Days_Employed,Occupation_Type,Family_Size,Age,Employed,Income_level,Good_Customer
0,5008804,M,True,True,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,09-22-1990,-4542,NaN,2,32,True,400K-500K,False
1,5008805,M,True,True,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,09-22-1990,-4542,NaN,2,32,True,400K-500K,False
2,5008806,M,True,True,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,10-19-1964,-1134,Security staff,2,58,True,100K-200K,False
3,5008808,F,True,True,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,04-10-1971,-3051,Sales staff,1,52,True,200K-300K,False
4,5008809,F,True,True,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,04-10-1971,-3051,Sales staff,1,52,True,200K-300K,True

In [69]:
df.shape

(438463, 18)